dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxEvadc_bf.h
/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.FCCHNR */
#define IFX_EVADC_FC_FCCTRL_FCCHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.FCCHNR */
#define IFX_EVADC_FC_FCCTRL_FCCHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.FCCHNR */
#define IFX_EVADC_FC_FCCTRL_FCCHNR_OFF (26u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.XTWC */
#define IFX_EVADC_FC_FCCTRL_XTWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.XTWC */
#define IFX_EVADC_FC_FCCTRL_XTWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.XTWC */
#define IFX_EVADC_FC_FCCTRL_XTWC_OFF (31u)

/** \brief Length for Ifx_EVADC_FC_FCM_Bits.RUNCOMP */
#define IFX_EVADC_FC_FCM_RUNCOMP_LEN (2u)

/** \brief Mask for Ifx_EVADC_FC_FCM_Bits.RUNCOMP */
#define IFX_EVADC_FC_FCM_RUNCOMP_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_FC_FCM_Bits.RUNCOMP */
#define IFX_EVADC_FC_FCM_RUNCOMP_OFF (0u)

/** \brief Length for Ifx_EVADC_FC_FCM_Bits.RUNRAMP */
#define IFX_EVADC_FC_FCM_RUNRAMP_LEN (2u)

/** \brief Mask for Ifx_EVADC_FC_FCM_Bits.RUNRAMP */
#define IFX_EVADC_FC_FCM_RUNRAMP_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_FC_FCM_Bits.RUNRAMP */
#define IFX_EVADC_FC_FCM_RUNRAMP_OFF (2u)

/** \brief Length for Ifx_EVADC_FC_FCM_Bits.FCRDIR */
#define IFX_EVADC_FC_FCM_FCRDIR_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCM_Bits.FCRDIR */
#define IFX_EVADC_FC_FCM_FCRDIR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCM_Bits.FCRDIR */
#define IFX_EVADC_FC_FCM_FCRDIR_OFF (4u)

/** \brief Length for Ifx_EVADC_FC_FCM_Bits.ANON */
#define IFX_EVADC_FC_FCM_ANON_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCM_Bits.ANON */
#define IFX_EVADC_FC_FCM_ANON_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCM_Bits.ANON */
#define IFX_EVADC_FC_FCM_ANON_OFF (5u)

/** \brief Length for Ifx_EVADC_FC_FCM_Bits.ACSD */
#define IFX_EVADC_FC_FCM_ACSD_LEN (2u)

/** \brief Mask for Ifx_EVADC_FC_FCM_Bits.ACSD */
#define IFX_EVADC_FC_FCM_ACSD_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_FC_FCM_Bits.ACSD */
#define IFX_EVADC_FC_FCM_ACSD_OFF (6u)

/** \brief Length for Ifx_EVADC_FC_FCM_Bits.FCTRIV */
#define IFX_EVADC_FC_FCM_FCTRIV_LEN (8u)

/** \brief Mask for Ifx_EVADC_FC_FCM_Bits.FCTRIV */
#define IFX_EVADC_FC_FCM_FCTRIV_MSK (0xffu)

/** \brief Offset for Ifx_EVADC_FC_FCM_Bits.FCTRIV */
#define IFX_EVADC_FC_FCM_FCTRIV_OFF (8u)

/** \brief Length for Ifx_EVADC_FC_FCM_Bits.SRG */
#define IFX_EVADC_FC_FCM_SRG_LEN (2u)

/** \brief Mask for Ifx_EVADC_FC_FCM_Bits.SRG */
#define IFX_EVADC_FC_FCM_SRG_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_FC_FCM_Bits.SRG */
#define IFX_EVADC_FC_FCM_SRG_OFF (16u)

/** \brief Length for Ifx_EVADC_FC_FCM_Bits.AUE */
#define IFX_EVADC_FC_FCM_AUE_LEN (2u)

/** \brief Mask for Ifx_EVADC_FC_FCM_Bits.AUE */
#define IFX_EVADC_FC_FCM_AUE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_FC_FCM_Bits.AUE */
#define IFX_EVADC_FC_FCM_AUE_OFF (18u)

/** \brief Length for Ifx_EVADC_FC_FCM_Bits.SSE */
#define IFX_EVADC_FC_FCM_SSE_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCM_Bits.SSE */
#define IFX_EVADC_FC_FCM_SSE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCM_Bits.SSE */
#define IFX_EVADC_FC_FCM_SSE_OFF (20u)

/** \brief Length for Ifx_EVADC_FC_FCM_Bits.FCMWC */
#define IFX_EVADC_FC_FCM_FCMWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCM_Bits.FCMWC */
#define IFX_EVADC_FC_FCM_FCMWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCM_Bits.FCMWC */
#define IFX_EVADC_FC_FCM_FCMWC_OFF (21u)

/** \brief Length for Ifx_EVADC_FC_FCM_Bits.FCREF */
#define IFX_EVADC_FC_FCM_FCREF_LEN (10u)

/** \brief Mask for Ifx_EVADC_FC_FCM_Bits.FCREF */
#define IFX_EVADC_FC_FCM_FCREF_MSK (0x3ffu)

/** \brief Offset for Ifx_EVADC_FC_FCM_Bits.FCREF */
#define IFX_EVADC_FC_FCM_FCREF_OFF (22u)

/** \brief Length for Ifx_EVADC_FC_FCRAMP0_Bits.FCRCOMPA */
#define IFX_EVADC_FC_FCRAMP0_FCRCOMPA_LEN (10u)

/** \brief Mask for Ifx_EVADC_FC_FCRAMP0_Bits.FCRCOMPA */
#define IFX_EVADC_FC_FCRAMP0_FCRCOMPA_MSK (0x3ffu)

/** \brief Offset for Ifx_EVADC_FC_FCRAMP0_Bits.FCRCOMPA */
#define IFX_EVADC_FC_FCRAMP0_FCRCOMPA_OFF (0u)

/** \brief Length for Ifx_EVADC_FC_FCRAMP0_Bits.FCRSTEP */
#define IFX_EVADC_FC_FCRAMP0_FCRSTEP_LEN (8u)

/** \brief Mask for Ifx_EVADC_FC_FCRAMP0_Bits.FCRSTEP */
#define IFX_EVADC_FC_FCRAMP0_FCRSTEP_MSK (0xffu)

/** \brief Offset for Ifx_EVADC_FC_FCRAMP0_Bits.FCRSTEP */
#define IFX_EVADC_FC_FCRAMP0_FCRSTEP_OFF (16u)

/** \brief Length for Ifx_EVADC_FC_FCRAMP0_Bits.FSWC */
#define IFX_EVADC_FC_FCRAMP0_FSWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCRAMP0_Bits.FSWC */
#define IFX_EVADC_FC_FCRAMP0_FSWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCRAMP0_Bits.FSWC */
#define IFX_EVADC_FC_FCRAMP0_FSWC_OFF (31u)

/** \brief Length for Ifx_EVADC_FC_FCRAMP1_Bits.FCRCOMPB */
#define IFX_EVADC_FC_FCRAMP1_FCRCOMPB_LEN (10u)

/** \brief Mask for Ifx_EVADC_FC_FCRAMP1_Bits.FCRCOMPB */
#define IFX_EVADC_FC_FCRAMP1_FCRCOMPB_MSK (0x3ffu)

/** \brief Offset for Ifx_EVADC_FC_FCRAMP1_Bits.FCRCOMPB */
#define IFX_EVADC_FC_FCRAMP1_FCRCOMPB_OFF (0u)

/** \brief Length for Ifx_EVADC_FC_FCBFL_Bits.BFL */
#define IFX_EVADC_FC_FCBFL_BFL_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCBFL_Bits.BFL */
#define IFX_EVADC_FC_FCBFL_BFL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCBFL_Bits.BFL */
#define IFX_EVADC_FC_FCBFL_BFL_OFF (0u)

/** \brief Length for Ifx_EVADC_FC_FCBFL_Bits.BFA */
#define IFX_EVADC_FC_FCBFL_BFA_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCBFL_Bits.BFA */
#define IFX_EVADC_FC_FCBFL_BFA_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCBFL_Bits.BFA */
#define IFX_EVADC_FC_FCBFL_BFA_OFF (4u)

/** \brief Length for Ifx_EVADC_FC_FCBFL_Bits.BFI */
#define IFX_EVADC_FC_FCBFL_BFI_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCBFL_Bits.BFI */
#define IFX_EVADC_FC_FCBFL_BFI_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCBFL_Bits.BFI */
#define IFX_EVADC_FC_FCBFL_BFI_OFF (8u)

/** \brief Length for Ifx_EVADC_FC_FCBFL_Bits.BFS */
#define IFX_EVADC_FC_FCBFL_BFS_LEN (2u)

/** \brief Mask for Ifx_EVADC_FC_FCBFL_Bits.BFS */
#define IFX_EVADC_FC_FCBFL_BFS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_FC_FCBFL_Bits.BFS */
#define IFX_EVADC_FC_FCBFL_BFS_OFF (12u)

/** \brief Length for Ifx_EVADC_FC_FCBFL_Bits.BFM */
#define IFX_EVADC_FC_FCBFL_BFM_LEN (1u)

